package shannonFano

import (
	"reflect"
	"testing"
)

func Test_shannonFano_Encode(t *testing.T) {
	type args struct {
		sourceData []byte
	}
	tests := []struct {
		name string
		args args
		want []byte
	}{
		{
			name: "Hello, world!",
			args: args{
				sourceData: []byte{72, 101, 108, 108, 111, 32, 119, 111, 114, 108, 100, 33},
			},
			want: []byte{0, 0, 0, 17, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 108, 111, 32, 119, 114, 100, 33, 72, 101, 64, 73, 78, 42, 119},
		},
		{
			name: "Hello my name is Kirill!",
			args: args{
				sourceData: []byte{72, 101, 108, 108, 111, 32, 109, 121, 32, 110, 97, 109, 101, 32, 105, 115, 32, 75, 105, 114, 105, 108, 108, 33},
			},
			want: []byte{0, 0, 0, 29, 0, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 121, 0, 0, 0, 33, 72, 101, 108, 111, 32, 109, 0, 0, 110, 97, 105, 115, 75, 114, 64, 72, 141, 21, 164, 74, 138, 85, 166, 86, 209, 23},
		},
		{
			name: "Привет, меня зовут Кирилл!",
			args: args{
				sourceData: []byte{208, 159, 209, 128, 208, 184, 208, 178, 208, 181, 209, 130, 44, 32, 208, 188, 208, 181, 208, 189, 209, 143, 32, 208, 183, 208, 190, 208, 178, 209, 131, 209, 130, 32, 208, 154, 208, 184, 209, 128, 208, 184, 208, 187, 208, 187, 33},
			},
			want: []byte{0, 0, 0, 49, 0, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 209, 128, 184, 0, 130, 44, 32, 0, 143, 183, 190, 131, 154, 187, 33, 208, 159, 0, 0, 0, 0, 0, 0, 178, 181, 0, 0, 0, 0, 0, 0, 188, 189, 4, 1, 18, 1, 129, 0, 72, 171, 56, 32, 4, 130, 35, 46, 10, 5, 129, 3, 130, 174, 13, 1, 137, 0, 193, 192, 239},
		},
	}
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			sf := &shannonFano{}
			if got := sf.Encode(tt.args.sourceData); !reflect.DeepEqual(got, tt.want) {
				t.Errorf("Encode() = %v, want %v", got, tt.want)
			}
		})
	}
}

func Test_shannonFano_Decode(t *testing.T) {
	type args struct {
		composedData []byte
	}
	tests := []struct {
		name string
		args args
		want []byte
	}{
		{
			name: "Hello, world!",
			args: args{
				composedData: []byte{0, 0, 0, 17, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 108, 111, 32, 119, 114, 100, 33, 72, 101, 64, 73, 78, 42, 119},
			},
			want: []byte{72, 101, 108, 108, 111, 32, 119, 111, 114, 108, 100, 33},
		},
		{
			name: "Hello my name is Kirill!",
			args: args{
				composedData: []byte{0, 0, 0, 29, 0, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 121, 0, 0, 0, 33, 72, 101, 108, 111, 32, 109, 0, 0, 110, 97, 105, 115, 75, 114, 64, 72, 141, 21, 164, 74, 138, 85, 166, 86, 209, 23},
			},
			want: []byte{72, 101, 108, 108, 111, 32, 109, 121, 32, 110, 97, 109, 101, 32, 105, 115, 32, 75, 105, 114, 105, 108, 108, 33},
		},
		{
			name: "Привет, меня зовут Кирилл!",
			args: args{
				composedData: []byte{0, 0, 0, 49, 0, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 209, 128, 184, 0, 130, 44, 32, 0, 143, 183, 190, 131, 154, 187, 33, 208, 159, 0, 0, 0, 0, 0, 0, 178, 181, 0, 0, 0, 0, 0, 0, 188, 189, 4, 1, 18, 1, 129, 0, 72, 171, 56, 32, 4, 130, 35, 46, 10, 5, 129, 3, 130, 174, 13, 1, 137, 0, 193, 192, 239},
			},
			want: []byte{208, 159, 209, 128, 208, 184, 208, 178, 208, 181, 209, 130, 44, 32, 208, 188, 208, 181, 208, 189, 209, 143, 32, 208, 183, 208, 190, 208, 178, 209, 131, 209, 130, 32, 208, 154, 208, 184, 209, 128, 208, 184, 208, 187, 208, 187, 33},
		},
	}
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			sf := &shannonFano{}
			if got := sf.Decode(tt.args.composedData); !reflect.DeepEqual(got, tt.want) {
				t.Errorf("Decode() = %v, want %v", got, tt.want)
			}
		})
	}
}
